package Chapter6;

public class Chapter6Summary {
/*  1. if문장의 소괄호 안에는 어떤 형태의 결과가 제공되어야 하나요? => boolean
    2. if조건에 맞지 않는 모든 경우를 처리할 때 사용하는 예약어는 뭔가요? => else
    3. switch를 사용할 수 있는 기본 자료형의 타입에는 어떤 것들이 있나요? => long을 제외한 정수
    4. switch 블록 안에 비교대상값 앞에 사용하는 예약어는 무엇인가요? => case
    5. switch조건을 빠져나가도록 하는 예약어는 무엇인가요? => break
    6. switch조건들에 맞지 않을때 기본처리를 하기 위한 예약어는 무엇인가요? => default
    7. while문의 소괄호 안에는 어떤 형태의 결과가 제공되어야 하나요? => boolean
    8. while문을 무조건 한번은 실행하게 하려면 어떻게 해야 하나요? => 괄호안의 값을 true가 되게 한다
    9. while문을 마음대로 빠져나가게 하려면 어떤 예약어를 사용하면 되나요? => break
    10. while문의 중간에 while문의 소괄호 점검 구문으로 건너뛰도록 할 때 사용하는 예약어는 무엇인가요? => continue
    11. for루프의 소괄호 안의 가장 첫 구문(첫 세미콜론 앞의 문장)은 for 루프가 수행되는 동안 몇번 수행되나요? => 1번
    12. for루프의 소괄호 안의 중간에 있는 구문은 어떤 타입의 결과가 제공되어야 하나요? => 조건문
    13. for루프의 소괄호 안의 마지막에 있는 구문에서는 어떤 작업을 수행하나요? => 조건값 증가
}*/
