public class Chapter5_Summary {

    /*1. 값을 할당할 때 사용하는 연산자의 기호는 무엇인가요?
    답 : =
    2. 기보넉인 덧셈, 뺄셈, 곱셈, 나눗셈, 나머지를 계산할 때 사용하는 연산자의 기호는 무엇인가요?
    답 : +, -, *, /, %
    3. +=는 무엇을 할 때 사용하는 연산자인가요?
    답 : 왼쪽값에 오른쪽값을 더 한 값을 왼쪽에 다시 할당한다
    4. 여러분들이 연산의 순서를 모르거나 확실히 하고 싶을 때에는 어떤 기호를 사용해야 하나요?
    답 : ()
    5. ==와 !=의 차이는 무엇인가요?
    답 : ==는 같다, !=는 같지 않다
    6. <와 <=의 차지은 모엇인가요?
    답 : <는 작다, <=는 작거나 같다
    7. !연산자는 어떤 타입에 사용할 수 있나요?
    답 : boolean
    8. ?:로 표시하는 삼항 연산자의 ?와 :뒤에 명시해 주는 값은 무엇을 의미하나요?
    답 : true, false
    9. 자바는 형 변환을 한다고 했는데, short의 값을 long에 할당할 때에는 어떤것을 해 주어야 하나요?
    답 : 자동형변환이 된다.
    10. 반대로 long값을 short에 할당할 때에는 어떤 것을 해 주어야 하나요?
    답 : 캐스팅을 해 주어야 한다. (long)
    11. 9와 10 경우 중 어떤 경우가 기존 값이 사라지고, 엉뚱한 값으로 바뀔 수 있나요?
    답 : 큰 값이 작은값에 할당되었을때, 즉 10
*/}